
local M = {}

M.json = [[
[
{
	"question": "Кто рядом с Антоном?",
	"options": ["Гном", "Домовой", "Обезьяна", "Нечто еще не открытое наукой"],
	"answer": 4,
	"explanation": "Антон полностью перенял выражение лица!",
	"image_url": "mq1",
	"side": 1,
	"hide": [769, 191],
	"scale": 1.5
},
{
	"question": "Как звали котенка, которого подарили Веронике?",
	"options": ["Снежок", "Максик", "Стас Михайлов", "Барсик"],
	"answer": 2,
	"explanation": "Максик! Но, появись этот котик у нее сейчас, было бы более известное имя!",
	"image_url": "fq1",
	"side": 2
},
{
	"question": "Какое выражение лица у Антона?",
	"options": ["Плачет", "Смеется", "Покерфейс", "Это не Антон"],
	"answer": 1,
	"explanation": "Единственный зафиксированный случай слез Антона от Дениса!",
	"image_url": "mq2",
	"side": 1,
	"hide": [610, 320]
},
{
	"question": "Кого в детском саду на Новый Год играла Вероника?",
	"options": ["Снегурочку", "Снежинку", "Снежную королеву", "Человек паук"],
	"answer": 3,
	"explanation": "Снежную королеву! Хотя мы все знаем какой ответ правильный!",
	"image_url": "fq2",
	"side": 2
},
{
	"question": "Что держит над головой Антон?",
	"options": ["Волейбольный мяч", "Арбуз", "Брата", "Ничего, просто тянется к солнцу"],
	"answer": 2,
	"explanation": "С детства практиковал перенос рук на блоке!",
	"image_url": "mq3",
	"side": 1,
	"hide": [561, 403],
	"scale": 1.5
},
{
	"question": "Кого изображает Вероника?",
	"options": ["Ленивца", "Панду", "Скалолазку", "Уставшую от подготовки к свадьбе женщину"],
	"answer": 4,
	"explanation": "Тут ответ очевиден..",
	"image_url": "fq3",
	"side": 2
},
{
	"question": "Где Антон?",
	"options": ["1ый сверху", "2ой сверху", "3ий сверху", "4ый сверху"],
	"answer": 3,
	"explanation": "Тут сложный вопрос, надели одинаковые шляпы, не отличить их..",
	"image_url": "mq9",
	"replace_to": "mq9.1",
	"side": 1,
	"hide": [583, 46],
	"hide1": [381, 170],
	"hide2": [656, 329],
	"hide3": [495, 459],
	"scale": 1,
	"scale1": 1.5,
	"scale2": 2,
	"scale3": 0.5
},
{
	"question": "Как зовут собаку Вероники?",
	"options": ["Стеша", "Конфетка", "Малышка", "Мармеладка"],
	"answer": 4,
	"explanation": "А вот и не Стеша!",
	"image_url": "fq4",
	"side": 2,
	"hide": [570, -48]
},
{
	"question": "Что случилось с Антоном?",
	"options": ["Болит рука", "Болит нога", "Урок Марзака\n(учитель трудов и ОБЖ)", "Болит все тело"],
	"answer": 3,
	"explanation": "Это могло случиться с каждым, но случилось с ним..",
	"image_url": "mq4",
	"side": 1
},
{
	"question": "Как понятно из Инстаграма Вероники, Антон дарит ей розы и ...?",
	"options": ["Конфеты", "Кальмары", "Сухарики", "Соленья"],
	"answer": 2,
	"explanation": "Ну идеальный мужчина!",
	"image_url": "fq5",
	"side": 2,
	"scale": 2,
	"scale1": 2,
	"hide": [578, -12],
	"hide1": [919, 240]
},
{
	"question": "Сколько бутылок алкоголя держит в руках Антон?",
	"options": ["2", "3", "4", "5"],
	"answer": 2,
	"explanation": "Как вы понимаете, вариант с 1 бутылкой мы даже не рассматриваем!",
	"image_url": "mq7",
	"side": 1,
	"hide": [688, 105]
},
{
	"question": "На каком мероприятии Вероника?",
	"options": ["Девичник", "День металлурга", "Новый Год", "Никакого праздника, обычный день"],
	"answer": 1,
	"explanation": "Выглядит настолько хорошо, что подходит под каждое описание!",
	"image_url": "fq6",
	"side": 2
},
{
	"question": "Кто на фото с Даней?",
	"options": ["Антон", "Брат Антона", "Дмитрий Анатольевич", "Бородатый Антон"],
	"answer": 1,
	"explanation": "Самый сложный вопрос!",
	"image_url": "mq8",
	"side": 1,
	"hide": [325, 267],
	"scale": 2
},
{
	"question": "Что же сказала Вероника миллион раз?",
	"options": ["Беру время подумать", "Спрошу маму", "Сделаю раскладик", "ДА"],
	"answer": 4,
	"explanation": "НУ КОНЕЧНО ЖЕ ДА! (Но наталочку все таки надо проверить)",
	"image_url": "fq7",
	"side": 2,
	"hide": [571, -56],
	"scale": 0.5
}

]
]]

function M.get_questions()
	return json.decode(M.json)
end

return M
